tutorials/cases/posterDemo-backup/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Fill the entire column with a dry-wood packed bed (z = 0 → 0.096).
// porosityF = 0.40
// and the solid is 100 % wood (Ywood = 1, Ychar = 0). The bed starts hot
// (Ts = T = 800 K) so the Ts-driven particle shrinkage begins immediately;
// YADE packs 60 particles (5×1×12 monolayer) into this domain, touching
// all six walls and neighbours — self-supporting, no settling
// (see MPI_lambda.py). The box is 1 cell thick in y to match the quasi-2D mesh.

defaultFieldValues
(
    volScalarFieldValue porosityF  1.0
    volScalarFieldValue porosityF0 1.0
    volScalarFieldValue Ywood      0.0
    volScalarFieldValue Ychar      0.0
);

regions
(
    boxToCell
    {
        box (0 0 0) (0.04 0.004 0.096);
        fieldValues
        (
            volScalarFieldValue porosityF  0.40
            volScalarFieldValue porosityF0 0.40
            volScalarFieldValue Ywood      1.0
            volScalarFieldValue Ychar      0.0
            volScalarFieldValue Ts         800
            volScalarFieldValue T          800
        );
    }
);

// ************************************************************************* //
